#include "GameClient.h"
#include "Fonts.h"
#include <Detours/detours.h>
#include <map>
#include <iostream>

#include <d3d9.h>
#include <d3dcompiler.h>

#undef min
#undef max

#include <msdfgen/msdfgen.h>
#include <msdfgen/msdfgen-ext.h>

#include <ft2build.h>
#include FT_FREETYPE_H
#include FT_OUTLINE_H
#include FT_BBOX_H
#include FT_GLYPH_H

#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dcompiler.lib")


// ----  if you want overkill quality, try raising these
#define SDF_SAMPLER_SLOT 13
#define ATLAS_SIZE 1024 // 1024-2048
#define ATLAS_GUTTER 12 // usually spread + 2-4
#define SDF_RENDER_SIZE 64.0 // 48-128
#define SDF_SPREAD 8.0 // 6-12
#define D3DFMT D3DFMT_A8R8G8B8 // D3DFMT_A8R8G8B8-D3DFMT_A16B16G16R16
#define ALLOW_UNSAFE_FONTS false // due to how distance fields are calculated, some fonts with self-intersecting contours (e.g. diediedie) will break
                                // set to true to skip font validation
// ----


#define g_FontPixelShader (*(FontShaderData**)0x00C7D2CC)
#define g_FontVertexShader (*(FontShaderData**)0x00C7D2D0)

static IDirect3DPixelShader9* s_cachedPSShader = nullptr;
static IDirect3DVertexShader9* s_cachedVSShader = nullptr;

static FT_Library g_realFtLibrary = nullptr;

static const double FLATTEN_EPS = 0.5;
static const double EPS = 1e-9;
static const double MAX_COORD = 1e9;
static const int MIN_CONTOUR_SIZE = 3;
static const int MAX_CURVE_SAMPLES = 10;


// these structs are NOT to be trusted, rough LLM estimation
struct FontShaderData
{
    IUnknown* base_interface;                       // 0x00
    DWORD unknown_vtable_ptr;                       // 0x04
    IDirect3DResource9* resource_interface_1;       // 0x08
    IDirect3DResource9* resource_interface_2;       // 0x0C
    IDirect3DBaseTexture9* texture_interface_1;     // 0x10
    IDirect3DBaseTexture9* texture_interface_2;     // 0x14
    void* additional_resource;                      // 0x18
    DWORD reference_count;                          // 0x1C

    union {                                         // 0x20
        IDirect3DPixelShader9* pixel_shader;
        IDirect3DVertexShader9* vertex_shader;
    };

    DWORD shader_version;                           // 0x24
    DWORD reserved_1;                               // 0x28
    DWORD compilation_flags;                        // 0x2C

    DWORD shader_enabled;                           // 0x30
    DWORD reserved_2;                               // 0x34
    DWORD reserved_3;                               // 0x38
    DWORD texture_dimension_flags;                  // 0x3C
    DWORD constant_buffer_size;                     // 0x40
    DWORD active_samplers;                          // 0x44
    DWORD instruction_slots;                        // 0x48
    DWORD bytecode_length;                          // 0x4C

    void* bytecode_memory;                          // 0x50
    DWORD reserved_4;                               // 0x54
    DWORD creation_timestamp;                       // 0x58
    DWORD bytecode_checksum;                        // 0x5C

    void* texture_stage_state;                      // 0x60
    void* sampler_state_block;                      // 0x64
    DWORD active_texture_stages;                    // 0x68
    DWORD primary_sampler_index;                    // 0x6C
    DWORD blend_stage_enabled;                      // 0x70
    DWORD alpha_test_enabled;                       // 0x74
    DWORD render_state_flags;                       // 0x78
    DWORD fog_enabled;                              // 0x7C

    DWORD lighting_enabled;                         // 0x80
    DWORD vertex_shader_constants;                  // 0x84
    DWORD pixel_shader_constants;                   // 0x88
    DWORD texture_filter_flags;                     // 0x8C
    DWORD mipmap_settings;                          // 0x90
    DWORD reserved_5;                               // 0x94
    DWORD reserved_6;                               // 0x98
    DWORD reserved_7;                               // 0x9C

    DWORD font_antialiasing;                        // 0xA0
    DWORD subpixel_rendering;                       // 0xA4
    DWORD reserved_8;                               // 0xA8

    char coordinate_data[20];                       // 0xAC-0xBF

    DWORD extended_flags_1;                         // 0xC0
    DWORD reserved_9;                               // 0xC4
    float unknown_float_1;                          // 0xC8
    DWORD combined_hash;                            // 0xCC
    DWORD validation_flag;                          // 0xD0

    WORD max_texture_width;                         // 0xD4
    WORD max_texture_height;                        // 0xD8
    DWORD padding[8];                               // 0xDC-0xFB
    DWORD final_validation;                         // 0xFC
};

template<typename T>
struct TSGrowableArray
{
    uint32_t m_capacity;
    uint32_t m_count;
    T* m_data;
    uint32_t m_granularity;
};

struct CFontVertex
{
    C3Vector pos;
    float u, v;
};

struct CLayoutFrame;
struct CFramePoint
{
    float x, y;
    CLayoutFrame* layoutFrame;
    uint32_t flags;
};

struct CLayoutChildNode
{
    CLayoutChildNode* prev;
    CLayoutChildNode* next;
    CLayoutFrame* child;
    uint32_t ukn;
};

struct CLayoutFrame_vtbl
{
    void(__thiscall* Destroy)(void* pThis);
    void(__thiscall* LoadXML)(void* pThis);
    CLayoutFrame* (__thiscall* GetLayoutParent)(void* pThis);
    void(__thiscall* PropagateProtectFlagToParent)(void* pThis);
    bool(__thiscall* AreChildrenProtected)(void* pThis, int* result);
    void(__thiscall* SetLayoutScale)(void* pThis);
    void(__thiscall* SetLayoutDepth)(void* pThis);
    void(__thiscall* SetWidth)(void* pThis, uint32_t width);
    void(__thiscall* SetHeight)(void* pThis, uint32_t height);
    void(__thiscall* SetSize)(void* pThis);
    double(__thiscall* GetWidth)(void* pThis);
    double(__thiscall* GetHeight)(void* pThis);
    void(__thiscall* GetSize)(void* pThis);
    void(__thiscall* GetClampRectInsets)(void* pThis);
    void(__thiscall* ukn4)(void* pThis);
    int(__thiscall* CanBeAnchorFor)(void* pThis, void* other);
    void(__thiscall* ukn6)(void* pThis);
    void(__thiscall* ukn7)(void* pThis);
    void(__thiscall* OnFrameSizeChanged)(void* pThis);
};

struct CLayoutFrame
{
    CLayoutFrame_vtbl* __vftable;       // 0x00
    uint32_t ukn1;                      // 0x04
    uint32_t ukn2;                      // 0x08
    CFramePoint* framePoints[9];        // 0x0C
    uint32_t ukn3;                      // 0x30
    CLayoutChildNode* childUkn;         // 0x34
    CLayoutChildNode* children;         // 0x38
    uint32_t ukn4;                      // 0x3C
    uint32_t flags;                     // 0x40
    float left;                         // 0x44
    float right;                        // 0x48
    float top;                          // 0x4C
    float bottom;                       // 0x50
    float width;                        // 0x54
    float height;                       // 0x58
    float scale;                        // 0x5C
    float f8;                           // 0x60
    float minResizeY;                   // 0x64
    float minResizeX;                   // 0x68
    float maxResizeY;                   // 0x6C
    float maxResizeX;                   // 0x70
};

struct CGlyphMetrics
{
    void* m_pixelData;
    uint32_t m_bufferSize;
    uint32_t m_width;
    uint32_t m_height;
    uint32_t m_widthPadded;
    float m_advanceX;
    float m_horiBearingX;
    uint32_t unk_24;
    uint32_t m_bearingY;
    uint32_t m_verAdv;
    float v1, u0, v0, u1;
}; // sizeof = 0x38

struct CGlyphCacheEntry
{
    uint32_t m_codepoint;
    void* m_ptr1;
    void* m_ptr2;
    void* m_ptr3;
    void* m_ptr4;
    char unk_14[20];
    uint32_t m_texturePageIndex;
    CFramePoint* m_atlasCellIndex;
    uint32_t m_cellIndexMin;
    uint32_t m_cellIndexMax;
    CGlyphMetrics m_metrics;
}; // sizeof = 0x70

struct CFontGeomBatch
{
    CFontGeomBatch* m_prev;
    CFontGeomBatch* m_next;
    TSGrowableArray<CFontVertex> m_verts;
    TSGrowableArray<uint16_t> m_indices;
};

struct CGlyphTexCell
{
    uint32_t codepoint;
    uint16_t u0, v0;
    uint16_t u1, v1;
    uint16_t width;
    uint16_t height;
    uint32_t flags;
};

struct CFontCache
{
    uint32_t m_bucketCount;
    uint32_t m_entryCount;
    CGlyphTexCell** m_buckets;
    uint32_t m_mask;
};

struct CFontTextureCache
{
    IDirect3DTexture9* m_texture;
    uint32_t m_pageInfo;
    uint32_t m_flags;
    float m_scaleX;
    float m_scaleY;
    void* m_glyphs;
};

struct CFontResource
{
    char unk[36];
    FT_Face fontFace;
};

struct CFontFaceMapEntry
{
    uint32_t unk_00;
    FT_Face* fontFace;
    void* m_cache2; // CGxString__FontObject::cache2
};

struct CFontFaceWrapper
{
    CFontFaceMapEntry m_faceMap[16];
};

struct CFontObject
{
    void* m_meta;                             // 0x00
    CFontObject* m_next;                      // 0x04
    uint32_t unk_08;                          // 0x08
    char* m_fontName;                         // 0x0C
    char* m_fontFamily;                       // 0x10
    void* m_resourceHandle;                   // 0x14
    uint32_t m_flags;                         // 0x18
    CFontCache* m_glyphCacheByCodepoint;      // 0x1C
    CFontCache* m_kerningCache;               // 0x20
    uint32_t m_fontStyle;                     // 0x24
    uint32_t m_pixelHeight;                   // 0x28
    uint32_t m_pixelWidth;                    // 0x2C
    CFontFaceWrapper* m_faceWrapper;          // 0x30
    uint32_t unk_34;                          // 0x34
    uint32_t m_glyphHashMapMask;              // 0x38
    void* m_resourceHandle2;                  // 0x3C
    void* m_scriptObject;                     // 0x40
    void* m_kerningData;                      // 0x44
    CFontTextureCache* m_textureCache;        // 0x48
    uint32_t m_texCacheResizeCounter;         // 0x4C
    uint32_t m_fontId;                        // 0x50
    uint32_t m_fontUnitHeight;                // 0x54
    void* m_cache4;                           // 0x58
    uint32_t m_atlasTextureSize;              // 0x5C
    uint32_t m_cacheHashMask;                 // 0x60
    uint32_t unk_64;                          // 0x64
    void* m_atlasManager;                     // 0x68
    void* m_fontMetrics;                      // 0x6C
    CFontResource* m_fontResource;            // 0x70
    char m_fontPath[260];                     // 0x74
    CFontTextureCache m_atlasPages[8];        // 0x178
    float m_kerningScale;                     // 0x238
    float unk_23C;                            // 0x23C
    float m_fontHeight;                       // 0x240
    uint32_t unk_244;                         // 0x244
    uint32_t m_effectivePixelHeight;          // 0x248
    uint32_t m_rasterTargetSize;              // 0x24C
};

struct CGxString
{
    CGxString* m_ll_next;                       // 0x00
    CGxString* m_ll_prev;                       // 0x04
    char unk_08[20];                            // 0x08
    float m_fontSizeMult;                       // 0x1C
    C3Vector m_anchorPos;                       // 0x20
    uint32_t m_textColor;                       // 0x2C
    uint32_t m_shadowColor;                     // 0x30
    Vec2D<float> m_shadowOffset;                // 0x34
    float m_widthBBox;                          // 0x40
    float m_heightBBox;                         // 0x44
    CFontObject* m_fontObj;                     // 0x48
    char* m_text;                               // 0x4C
    uint32_t m_text_capacity;                   // 0x50
    uint32_t m_vertAlign;                       // 0x54
    uint32_t m_horzAlign;                       // 0x58
    float m_lineSpacing;                        // 0x5C
    uint32_t m_flags;                           // 0x60
    uint32_t m_bitfield;                        // 0x64
    uint32_t m_isDirty;                         // 0x68
    int32_t m_gradientStartChar;                // 0x6C
    int32_t m_gradientLength;                   // 0x70
    C3Vector m_finalPos;                        // 0x74
    TSGrowableArray<void*> m_hyperlinks;        // 0x80
    TSGrowableArray<void*> m_embeddedTextures;  // 0x90
    char unk_A0[4];                             // 0xA0
    uint32_t m_hyperlinkClickCount;             // 0xA4
    TSGrowableArray<void*> m_gradientInfo;      // 0xA8
    CFontGeomBatch* m_geomBuffers[8];           // 0xB8
    uint32_t m_timeSinceUpdate;                 // 0xD8
    char unk_E0[20];                            // 0xDC
};

struct FaceCacheKey
{
    FT_Face face;
    uint32_t codepoint;

    bool operator<(const FaceCacheKey& other) const {
        if (face != other.face) return face < other.face;
        return codepoint < other.codepoint;
    }
};

struct GlyphMetrics
{
    float u0, v0, u1, v1;
    int width, height;
    int bitmapLeft, bitmapTop;
};

struct FontHandle
{
    msdfgen::FontHandle* msdfFont;
    FT_Face ftFace;
    const FT_Byte* fontData;
    FT_Long fontDataSize;
    bool isValid;

    IDirect3DTexture9* atlasTexture;
    int atlasNextX = ATLAS_GUTTER;
    int atlasNextY = ATLAS_GUTTER;
    int atlasRowHeight = 0;
    std::map<uint32_t, GlyphMetrics> glyphCache;

    FontHandle() : msdfFont(nullptr), ftFace(nullptr), fontData(nullptr),
        fontDataSize(0), isValid(false), atlasTexture(nullptr),
        atlasNextX(ATLAS_GUTTER), atlasNextY(ATLAS_GUTTER),
        atlasRowHeight(0) {}
    ~FontHandle() {
